test/loadtest.yml
config:
  target: "{{ $processEnvironment.PROTOCOL }}://{{ $processEnvironment.HOST }}:{{ $processEnvironment.PORT }}"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 120 # ramp up arrival rate from 10 to 50 over 2 minutes
      arrivalRate: 10 # with 10 new virtual users (arriving every second (on average).
      rampTo: 50 # with 50 new virtual users (arriving every second (on average).
      name: "Warm up the application"
    - duration: 600 # followed by 10 minutes at 50 arrivals per second
      arrivalRate: 50 # RPS
      name: "Sustained max load"
  defaults:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_3) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/74.0.3729.169 Safari/537.36'
scenarios:
  - flow:
      - get:
          url: "/__user-agent__"